RIOT-OS/RIOT/cpu/cc2538/radio/cc2538-rf.c
/*
 * Copyright (C) 2015 Loci Controls Inc.
 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup     cpu_cc2538
 * @{
 *
 * @file        cc2538-rf.c
 * @brief       Low-level radio driver for the CC2538
 *
 * @author      Ian Martin <ian@locicontrols.com>
 * @}
 */

#include <stdio.h>
#include <string.h>

#include "msg.h"
#include "thread.h"

#include "cc2538-rf.h"

#include "byteorder.h"
#include "transceiver.h"

#define ENABLE_DEBUG 0
#include "debug.h"

#define OUTPUT_POWER_MIN            -24  /**< Min output power in dBm */
#define OUTPUT_POWER_MAX            + 7  /**< Max output power in dBm */
#define NUM_POWER_LEVELS            ( OUTPUT_POWER_MAX - OUTPUT_POWER_MIN + 1 )

#define CC2538_MIN_FREQ             2394
#define CC2538_MAX_FREQ             2507

#ifndef ENABLE_RF_STATUS_LEDS
#define ENABLE_RF_STATUS_LEDS       1
#endif /* ENABLE_RF_STATUS_LEDS */

/* IEEE 802.15.4 defined constants (2.4 GHz logical channels) */
#define IEEE802154_MIN_FREQ         2405 /**< Min. frequency (2405 MHz) */
#define IEEE802154_MAX_FREQ         2480 /**< Max. frequency (2480 MHz) */

#define IEEE802154_MIN_CHANNEL      11   /**< Min. channel (2405 MHz) */
#define IEEE802154_MAX_CHANNEL      26   /**< Max. channel (2480 MHz) */
#define IEEE802154_CHANNEL_SPACING  5    /**< Channel spacing in MHz  */

#define IEEE802154_CHAN2FREQ(chan)  ( IEEE802154_MIN_FREQ + ((chan) - IEEE802154_MIN_CHANNEL) * IEEE802154_CHANNEL_SPACING )
#define IEEE802154_FREQ2CHAN(freq)  ( IEEE802154_MIN_CHANNEL + ((freq) - IEEE802154_MIN_FREQ) / IEEE802154_CHANNEL_SPACING )

#ifndef CC2538_RF_CHANNEL_DEFAULT
#define CC2538_RF_CHANNEL_DEFAULT   17
#endif /* CC2538_RF_CHANNEL_DEFAULT */

#define ABS_DIFF(x, y)              ( ((x) < (y))? ((y) - (x)) : ((x) - (y)) )
#define BOOLEAN(x)                  ( (x) != 0 )
#define NOT(x)                      ( (x) == 0 )
#define GET_BYTE(buffer, index)     ( (unsigned char*)(buffer) )[index]

#define BIT(n)                      ( 1 << (n) )

#define RFCORE_FLUSH_RECEIVE_FIFO() rfcore_strobe(ISFLUSHRX)

static const uint8_t power_lut[NUM_POWER_LEVELS] = {
      0, /**< -24 dBm */
      7, /**< -23 dBm */
     15, /**< -22 dBm */
     22, /**< -21 dBm */
     29, /**< -20 dBm */
     37, /**< -19 dBm */
     44, /**< -18 dBm */
     51, /**< -17 dBm */
     59, /**< -16 dBm */
     66, /**< -15 dBm */
     77, /**< -14 dBm */
     88, /**< -13 dBm */
     93, /**< -12 dBm */
     98, /**< -11 dBm */
    106, /**< -10 dBm */
    114, /**<  -9 dBm */
    125, /**<  -8 dBm */
    136, /**<  -7 dBm */
    141, /**<  -6 dBm */
    145, /**<  -5 dBm */
    153, /**<  -4 dBm */
    161, /**<  -3 dBm */
    169, /**<  -2 dBm */
    176, /**<  -1 dBm */
    182, /**<   0 dBm */
    197, /**<   1 dBm */
    205, /**<   2 dBm */
    213, /**<   3 dBm */
    225, /**<   4 dBm */
    237, /**<   5 dBm */
    246, /**<   6 dBm */
    255, /**<   7 dBm */
};

static kernel_pid_t local_transceiver_pid = KERNEL_PID_UNDEF;
static bool monitor_mode = false;
static uint_fast8_t power_level_raw = 213; /**< 3 dBm */
static int channel = CC2538_RF_CHANNEL_DEFAULT;

cc2538_packet_t cc2538_packet;

/* pointer to the callback low-level function for packet reception */
static receive_802154_packet_callback_t recv_func = NULL;

/**
 * @brief RFCORE_XREG_RFERRM bits
 */
enum {
    STROBE_ERR = BIT(6),
    TXUNDERF   = BIT(5),
    TXOVERF    = BIT(4),
    RXUNDERF   = BIT(3),
    RXOVERF    = BIT(2),
    RXABO      = BIT(1),
    NLOCK      = BIT(0),
};

/**
 * @brief RFCORE_XREG_FRMCTRL0 bits
 */
enum {
    ENERGY_SCAN      = BIT(4),
    AUTOACK          = BIT(5),
    AUTOCRC          = BIT(6),
    APPEND_DATA_MODE = BIT(7),
};

/**
 * @brief RFCORE_XREG_RFIRQM0 / RFCORE_XREG_RFIRQF0 bits
 */
enum {
    ACT_UNUSED       = BIT(0),
    SFD              = BIT(1), /**< Start of frame event */
    FIFOP            = BIT(2),
    SRC_MATCH_DONE   = BIT(3),
    SRC_MATCH_FOUND  = BIT(4),
    FRAME_ACCEPTED   = BIT(5),
    RXPKTDONE        = BIT(6), /**< End of frame event */
    RXMASKZERO       = BIT(7),
};

/**
 * @brief RFCORE_XREG_RFIRQF1 bits
 */
enum {
    CSP_WAIT    = BIT(5),
    CSP_STOP    = BIT(4),
    CSP_MANINT  = BIT(3),
    RFIDLE      = BIT(2),
    TXDONE      = BIT(1), /**< End of frame event */
    TXACKDONE   = BIT(0),
};

typedef struct {
    cc2538_reg_t *reg_addr;
    uint32_t value;
} init_pair_t;

static const init_pair_t init_table[] = {
    {&SYS_CTRL_RCGCRFC,      0x01                     }, /* Enable the RF Core clock in run mode. */
    {&SYS_CTRL_SCGCRFC,      0x01                     }, /* Enable the RF Core clock in sleep mode. */
    {&SYS_CTRL_DCGCRFC,      0x01                     }, /* Enable the RF Core clock in deep sleep mode. */
    {&RFCORE_XREG_CCACTRL0,  0xf8                     }, /* -81 dB (from User Guide) */
    {&RFCORE_XREG_TXFILTCFG, 0x09                     }, /* TX anti-aliasing filter bandwidth */
    {&RFCORE_XREG_AGCCTRL1,  0x15                     }, /* target value for AGC control loop */
    {&ANA_REGS_IVCTRL,       0x0b                     }, /* Bias currents */
    {&RFCORE_XREG_MDMTEST1,  0x08                     },
    {&RFCORE_XREG_FSCAL1,    0x01                     }, /* Tune frequency calibration / Adjust current in VCO? */
    {&RFCORE_XREG_RXCTRL,    0x3f                     }, /* MCU default */
    {&RFCORE_XREG_MDMCTRL1,  0x14                     }, /* MCU default */
    {&RFCORE_XREG_ADCTEST0,  0x10                     }, /* MCU default */
    {&RFCORE_XREG_ADCTEST1,  0x0e                     }, /* MCU default */
    {&RFCORE_XREG_ADCTEST2,  0x03                     }, /* MCU default */
    {&RFCORE_XREG_CSPT,      0xff                     }, /* Disable the CSPT register compare function (MCU default) */
    {&RFCORE_XREG_MDMCTRL0,  0x85                     }, /* Tune sync word detection by requiring two zero symbols before the sync word (MCU default) */
    {&RFCORE_XREG_FSCTRL,    0x55                     }, /* Adjust current in synthesizer (not MCU default, MCU default is 0x5A) */
    {&RFCORE_XREG_FRMCTRL0,  AUTOCRC | AUTOACK        }, /* Enable automatic CRC calculation and RSSI append */
    {&RFCORE_XREG_FRMCTRL1,  0x00                     }, /* STXON does not affect RXENABLE[6] */
    {&RFCORE_XREG_SRCMATCH,  0x00                     }, /* Disable source address matching and autopend */
    {&RFCORE_XREG_FIFOPCTRL, CC2538_RF_MAX_PACKET_LEN }, /* MAX FIFOP threshold */
    {&RFCORE_XREG_RFIRQM0,   FIFOP | RXPKTDONE        }, /* Acknowledge RF interrupts */
    {&RFCORE_XREG_RFERRM,    STROBE_ERR | TXUNDERF | TXOVERF | RXUNDERF | RXOVERF | NLOCK},
    {NULL, 0},
};

