RIOT-OS/RIOT/cpu/cc2538/radio/cc2538-rf.c
bool RFCORE_ASSERT_failure(const char *expr, const char *func, int line)
{
#if (DEVELHELP || ENABLE_DEBUG)
    DEBUG_PRINT("RFCORE_ASSERT(%s) failed at line %u in %s()!\n", expr, line, func);
    DEBUG_PRINT("  RFCORE_SFR_RFERRF = 0x%02x\n", (unsigned int)RFCORE_SFR_RFERRF);
#endif

    return false;
}

void rfcore_strobe(uint_fast8_t instr)
{
    RFCORE_SFR_RFST = instr;
}

uint_fast8_t rfcore_read_byte(void)
{
    RFCORE_ASSERT(RFCORE_XREG_RXFIFOCNT > 0);
    return RFCORE_SFR_RFDATA;
}

void rfcore_write_byte(uint_fast8_t byte)
{
    RFCORE_ASSERT(RFCORE_XREG_TXFIFOCNT < CC2538_RF_FIFO_SIZE);
    RFCORE_SFR_RFDATA = byte;
}

void rfcore_read_fifo(void *buf, uint_fast8_t len)
{
    uint_fast8_t n;

    RFCORE_ASSERT(len <= RFCORE_XREG_RXFIFOCNT);

    for (n = 0; n < len; n++) {
        GET_BYTE(buf, n) = RFCORE_SFR_RFDATA;
    }
}

void rfcore_write_fifo(const void *buf, uint_fast8_t len)
{
    uint_fast8_t n;

    RFCORE_ASSERT(len <= CC2538_RF_FIFO_SIZE - RFCORE_XREG_TXFIFOCNT);

    for (n = 0; n < len; n++) {
        RFCORE_SFR_RFDATA = GET_BYTE(buf, n);
    }
}

void cc2538_initialize(void)
{
    const init_pair_t *pair;

    for (pair = init_table; pair->reg_addr != NULL; pair++) {
        *pair->reg_addr = pair->value;
    }

    cc2538_set_monitor(monitor_mode);
    cc2538_set_tx_power_raw(power_level_raw);
    cc2538_set_channel(channel);

#if ENABLE_RF_STATUS_LEDS
    /* Select the observable signals (maximum of three) */
    RFCORE_XREG_RFC_OBS_CTRL0 = tx_active;
    RFCORE_XREG_RFC_OBS_CTRL1 = rx_active;
    RFCORE_XREG_RFC_OBS_CTRL2 = ffctrl_fifo;

    /* Select output pins for the three observable signals */
#ifdef BOARD_OPENMOTE
    CCTEST_OBSSEL0 = 0;                        /* PC0 = USB_SEL        */
    CCTEST_OBSSEL1 = 0;                        /* PC1 = N/C            */
    CCTEST_OBSSEL2 = 0;                        /* PC2 = N/C            */
    CCTEST_OBSSEL3 = 0;                        /* PC3 = USER_BUTTON    */
    CCTEST_OBSSEL4 = OBSSEL_EN | rfc_obs_sig0; /* PC4 = RED_LED        */
    CCTEST_OBSSEL5 = 0;                        /* PC5 = ORANGE_LED     */
    CCTEST_OBSSEL6 = OBSSEL_EN | rfc_obs_sig1; /* PC6 = YELLOW_LED     */
    CCTEST_OBSSEL7 = OBSSEL_EN | rfc_obs_sig2; /* PC7 = GREEN_LED      */
#else
    /* Assume BOARD_CC2538DK (or similar). */
    CCTEST_OBSSEL0 = OBSSEL_EN | rfc_obs_sig0; /* PC0 = LED_1 (red)    */
    CCTEST_OBSSEL1 = OBSSEL_EN | rfc_obs_sig1; /* PC1 = LED_2 (yellow) */
    CCTEST_OBSSEL2 = OBSSEL_EN | rfc_obs_sig2; /* PC2 = LED_3 (green)  */
    CCTEST_OBSSEL3 = 0;                        /* PC3 = LED_4 (red)    */
    CCTEST_OBSSEL4 = 0;                        /* PC4 = BTN_L          */
    CCTEST_OBSSEL5 = 0;                        /* PC5 = BTN_R          */
    CCTEST_OBSSEL6 = 0;                        /* PC6 = BTN_UP         */
    CCTEST_OBSSEL7 = 0;                        /* PC7 = BTN_DN         */
#endif /* RIOT_BOARD */

#endif /* ENABLE_RF_STATUS_LEDS */

    if (SYS_CTRL->I_MAP) {
        NVIC_SetPriority(RF_RXTX_ALT_IRQn, RADIO_IRQ_PRIO);
        NVIC_EnableIRQ(RF_RXTX_ALT_IRQn);

        NVIC_SetPriority(RF_ERR_ALT_IRQn, RADIO_IRQ_PRIO);
        NVIC_EnableIRQ(RF_ERR_ALT_IRQn);
    }
    else {
        NVIC_SetPriority(RF_RXTX_IRQn, RADIO_IRQ_PRIO);
        NVIC_EnableIRQ(RF_RXTX_IRQn);

        NVIC_SetPriority(RF_ERR_IRQn, RADIO_IRQ_PRIO);
        NVIC_EnableIRQ(RF_ERR_IRQn);
    }

    /* Flush the receive and transmit FIFOs */
    rfcore_strobe(ISFLUSHTX);

    cc2538_on();
}

void cc2538_init(kernel_pid_t tpid)
{
    local_transceiver_pid = tpid;
    cc2538_initialize();
}

bool cc2538_on(void)
{
    RFCORE_FLUSH_RECEIVE_FIFO();
    rfcore_strobe(ISRXON);
    return true;
}

void cc2538_off(void)
{
    /* Wait for ongoing TX to complete (e.g. this could be an outgoing ACK) */
    RFCORE_WAIT_UNTIL(RFCORE->XREG_FSMSTAT1bits.TX_ACTIVE == 0);

    RFCORE_FLUSH_RECEIVE_FIFO();

    /* Don't turn off if we are off as this will trigger a Strobe Error */
    if (RFCORE_XREG_RXENABLE != 0) {
        rfcore_strobe(ISRFOFF);
    }
}

bool cc2538_is_on(void)
{
    return RFCORE->XREG_FSMSTAT1bits.RX_ACTIVE || RFCORE->XREG_FSMSTAT1bits.TX_ACTIVE;
}

void cc2538_switch_to_rx(void)
{
    RFCORE_FLUSH_RECEIVE_FIFO();
    rfcore_strobe(ISRXON);
}

void isr_rfcorerxtx(void)
{
    uint_fast8_t irq_status0, irq_status1, len;
    static uint8_t rx_buf[256];
    cc2538_fcs_t fcs;

    irq_status1 = RFCORE_SFR_RFIRQF1;

    if (irq_status1) {
        RFCORE_SFR_RFIRQF1 = 0;
    }

    while ((irq_status0 = RFCORE_SFR_RFIRQF0)) {
        RFCORE_SFR_RFIRQF0 = 0;

        if (irq_status0 & FIFOP) {
            if (RFCORE_XREG_RXFIFOCNT < 1) {
                DEBUG("%s(): FIFOP = 1 but RXFIFOCNT = 0!\n", __FUNCTION__);
            }
            else {
                len = rfcore_read_byte();

                if (len < CC2538_FCS_LEN) {
                    DEBUG("%s(): length %u < CC2538_FCS_LEN!\n", __FUNCTION__, len);
                }
                else if (len > RFCORE_XREG_RXFIFOCNT) {
                    DEBUG("%s(): length %u > RXFIFOCNT!\n", __FUNCTION__, len);
                    RFCORE_FLUSH_RECEIVE_FIFO();
                }
                else {
                    len -= CC2538_FCS_LEN;

                    rfcore_read_fifo(rx_buf, len);
                    rfcore_read_fifo(&fcs, CC2538_FCS_LEN);

                    /* read buffer into ieee802154_frame */
                    ieee802154_frame_read(rx_buf, &cc2538_packet.frame, len + IEEE_802154_FCS_LEN);

                    /* if packet is not an ACK */
                    if (cc2538_packet.frame.fcf.frame_type != IEEE_802154_ACK_FRAME) {
#if ENABLE_DEBUG
                        ieee802154_frame_print_fcf_frame(&cc2538_packet.frame);
#endif

                        if (recv_func != NULL) {
                            recv_func((void *)rx_buf, len, fcs.rssi - CC2538_RSSI_OFFSET, fcs.lqi, fcs.crc);
                        }

                        if (netdev_rcv_data_cb != NULL) {
                            netdev_rcv_data_cb(
                                (netdev_t *)&cc2538_netdev,
                                cc2538_packet.frame.src_addr,
                                sizeof(cc2538_packet.frame.src_addr),
                                cc2538_packet.frame.dest_addr,
                                sizeof(cc2538_packet.frame.dest_addr),
                                (void *)rx_buf,
                                len
                            );
                        }

#ifdef MODULE_TRANSCEIVER
                        cc2538_packet.rssi = fcs.rssi - CC2538_RSSI_OFFSET;
                        cc2538_packet.crc = fcs.crc;
                        cc2538_packet.lqi = fcs.lqi;
                        cc2538_packet.length = len;

                        /* notify transceiver thread if any */
                        if (local_transceiver_pid != KERNEL_PID_UNDEF) {
                            msg_t m;
                            m.type = RCV_PKT_CC2538;
                            m.content.ptr = (void *)rx_buf;
#if DEVELHELP
                            int result = msg_send_int(&m, local_transceiver_pid);

                            if (result < 1) {
                                DEBUG_PRINT(
                                    "%s(): Unable to notify transceiver thread. msg_send_int() result was %d.\n",
                                    __FUNCTION__,
                                    result
                                );
                            }

#else
                            msg_send_int(&m, local_transceiver_pid);
#endif

