RIOT-OS/RIOT/cpu/cc2538/radio/cc2538-rf.c
                        }

#endif
                    } /* end if (cc2538_packet.frame.fcf.frame_type != IEEE_802154_ACK_FRAME) */
                }
            }
        }
    }

    if (sched_context_switch_request) {
        thread_yield();
    }
}

void isr_rfcoreerr(void)
{
    uint_fast8_t flags;

    /* Latch and clear the interrupt status */
    flags = RFCORE_SFR_RFERRF;
    RFCORE_SFR_RFERRF = 0;

    /* These conditions shouldn't happen if the driver is working properly */
    RFCORE_ASSERT(NOT(flags & RXUNDERF));
    RFCORE_ASSERT(NOT(flags & TXOVERF));
    RFCORE_ASSERT(NOT(flags & TXUNDERF));

    /* Fail in case of miscallaneous unexpected error conditions */
    RFCORE_ASSERT(NOT(flags & STROBE_ERR));

    DEBUG("%s(): RFERRF=0x%02x.\n", __FUNCTION__, flags);

    /* Flush the receive FIFO in case of a receive overflow */
    if (flags & RXOVERF) {
        DEBUG("%s(): RXOVERF detected!\n", __FUNCTION__);
        RFCORE_FLUSH_RECEIVE_FIFO();
    }

    /* Flush the receive FIFO in case of a receive overflow */
    if (flags & NLOCK) {
        /* The frequency synthesizer failed to achieve lock after time-out, or
         * lock is lost during reception. The receiver must be restarted to clear
         * this error situation. */
        DEBUG("%s(): NLOCK detected!\n", __FUNCTION__);
        RFCORE_FLUSH_RECEIVE_FIFO();
    }
}

void cc2538_set_monitor(bool mode)
{
    RFCORE->XREG_FRMFILT0bits.FRAME_FILTER_EN = NOT(mode);
    monitor_mode = mode;
}

bool cc2538_get_monitor(void)
{
    return NOT(RFCORE->XREG_FRMFILT0bits.FRAME_FILTER_EN);
}

void cc2538_set_freq(unsigned int freq)
{
    DEBUG("%s(%u): Setting frequency to ", __FUNCTION__, freq);

    if (freq < CC2538_MIN_FREQ) {
        freq = CC2538_MIN_FREQ;
    }
    else if (freq > CC2538_MAX_FREQ) {
        freq = CC2538_MAX_FREQ;
    }

    DEBUG("%u + %u = %u MHz.\n", CC2538_MIN_FREQ, freq - CC2538_MIN_FREQ, freq);
    RFCORE_XREG_FREQCTRL = freq - CC2538_MIN_FREQ;
}

void cc2538_set_channel(unsigned int chan)
{
    DEBUG("%s(%u);\n", __FUNCTION__, chan);

    cc2538_set_freq(IEEE802154_CHAN2FREQ(chan));
    channel = chan;
}

unsigned int cc2538_get_channel(void)
{
    return IEEE802154_FREQ2CHAN(CC2538_MIN_FREQ + RFCORE_XREG_FREQCTRL);
}

void cc2538_set_address(uint16_t addr)
{
    RFCORE_FFSM_SHORT_ADDR0 = addr;
    RFCORE_FFSM_SHORT_ADDR1 = addr >> 8;
}

void cc2538_set_address_long(uint64_t addr)
{
    RFCORE_FFSM_EXT_ADDR7 = addr >> (7 * 8);
    RFCORE_FFSM_EXT_ADDR6 = addr >> (6 * 8);
    RFCORE_FFSM_EXT_ADDR5 = addr >> (5 * 8);
    RFCORE_FFSM_EXT_ADDR4 = addr >> (4 * 8);
    RFCORE_FFSM_EXT_ADDR3 = addr >> (3 * 8);
    RFCORE_FFSM_EXT_ADDR2 = addr >> (2 * 8);
    RFCORE_FFSM_EXT_ADDR1 = addr >> (1 * 8);
    RFCORE_FFSM_EXT_ADDR0 = addr >> (0 * 8);
}

uint16_t cc2538_get_address(void)
{
    return (RFCORE_FFSM_SHORT_ADDR1 << 8) | RFCORE_FFSM_SHORT_ADDR0;
}

uint64_t cc2538_get_address_long(void)
{
    uint64_t addr = RFCORE_FFSM_EXT_ADDR7;
    addr <<= 8;
    addr |= RFCORE_FFSM_EXT_ADDR6;
    addr <<= 8;
    addr |= RFCORE_FFSM_EXT_ADDR5;
    addr <<= 8;
    addr |= RFCORE_FFSM_EXT_ADDR4;
    addr <<= 8;
    addr |= RFCORE_FFSM_EXT_ADDR3;
    addr <<= 8;
    addr |= RFCORE_FFSM_EXT_ADDR2;
    addr <<= 8;
    addr |= RFCORE_FFSM_EXT_ADDR1;
    addr <<= 8;
    addr |= RFCORE_FFSM_EXT_ADDR0;
    return addr;
}

void cc2538_set_pan(uint16_t pan)
{
    RFCORE_FFSM_PAN_ID0 = pan;
    RFCORE_FFSM_PAN_ID1 = pan >> 8;
}

uint16_t cc2538_get_pan(void)
{
    return (RFCORE_FFSM_PAN_ID1 << 8) | RFCORE_FFSM_PAN_ID0;
}

void cc2538_set_tx_power_raw(uint_fast8_t pow)
{
    RFCORE_XREG_TXPOWER = pow;
    power_level_raw = pow;
}

void cc2538_set_tx_power(int pow)
{
    if (pow < OUTPUT_POWER_MIN) {
        pow = OUTPUT_POWER_MIN;
    }
    else if (pow > OUTPUT_POWER_MAX) {
        pow = OUTPUT_POWER_MAX;
    }

    cc2538_set_tx_power_raw(power_lut[pow - OUTPUT_POWER_MIN]);
}

int cc2538_get_tx_power(void)
{
    int index;
    int best_index = 0;
    int best_delta = INT_MAX;
    int txpower;

    txpower = RFCORE_XREG_TXPOWER & 0xff;

    for (index = 0; index < NUM_POWER_LEVELS; index++) {
        int delta = ABS_DIFF(power_lut[index], txpower);

        if (delta < best_delta) {
            best_delta = delta;
            best_index = index;
        }
    }

    return OUTPUT_POWER_MIN + best_index;
}

bool cc2538_channel_clear(void)
{
    if (RFCORE->XREG_FSMSTAT0bits.FSM_FFCTRL_STATE == FSM_STATE_IDLE) {
        bool result;
        cc2538_on();
        RFCORE_WAIT_UNTIL(RFCORE->XREG_RSSISTATbits.RSSI_VALID);
        result = BOOLEAN(RFCORE->XREG_FSMSTAT1bits.CCA);
        cc2538_off();
        return result;
    }
    else {
        RFCORE_WAIT_UNTIL(RFCORE->XREG_RSSISTATbits.RSSI_VALID);
        return BOOLEAN(RFCORE->XREG_FSMSTAT1bits.CCA);
    }
}

radio_tx_status_t cc2538_load_tx_buf(ieee802154_packet_kind_t kind,
                                     ieee802154_node_addr_t dest,
                                     bool use_long_addr,
                                     bool wants_ack,
                                     void *buf,
                                     unsigned int len)
{
    mac_header_t hdr;
    uint_fast8_t hdr_size;
    static uint_fast8_t sequence_nr = 0;

    /* FCS : frame version 0, we don't manage security,
       nor batches of packets */
    switch (kind) {
        case PACKET_KIND_BEACON:
        case PACKET_KIND_DATA:
        case PACKET_KIND_ACK:
            hdr.type = kind;
            break;

        default:
            return RADIO_TX_INVALID_PARAM;
    }

    if (wants_ack) {
        hdr.type |= WANTS_ACK;
    }

    if (use_long_addr) {
        hdr.addr_type = ADDR_TYPE_LONG;
        hdr.long_addrs.dest_addr = HTONLL(dest.long_addr);
        hdr.long_addrs.src_addr  = HTONLL(cc2538_get_address_long());
        hdr_size = 3 + sizeof(long_addrs_t);
    }
    else {
        hdr.addr_type = ADDR_TYPE_SHORT;
        uint_fast16_t src_pan = cc2538_get_pan();

        if (dest.pan.id == src_pan) {
            hdr.type |= INTRA_PAN_COMPRESSION;
            hdr.short_addrs_compr.dest_pan  = HTONS(dest.pan.id);
            hdr.short_addrs_compr.dest_addr = HTONS(dest.pan.addr);
            hdr.short_addrs_compr.src_addr  = HTONS(cc2538_get_address());
            hdr_size = 3 + sizeof(short_addrs_compr_t);
        }
        else {
            hdr.short_addrs.dest_pan  = HTONS(dest.pan.id);
            hdr.short_addrs.dest_addr = HTONS(dest.pan.addr);
            hdr.short_addrs.src_pan   = HTONS(src_pan);
            hdr.short_addrs.src_addr  = HTONS(cc2538_get_address());
            hdr_size = 3 + sizeof(short_addrs_t);
        }
    }

    /* total frame size */
    if (CC2538_PACKET_LENGTH_SIZE + hdr_size + len > CC2538_RF_FIFO_SIZE) {
        return RADIO_TX_PACKET_TOO_LONG;
    }

    if (RFCORE->XREG_FSMSTAT1bits.TX_ACTIVE) {
        return RADIO_TX_MEDIUM_BUSY;
    }

    /* sequence number */
    hdr.sequence_nr = sequence_nr++;

    RFCORE_ASSERT(cc2538_is_on());

    rfcore_strobe(ISFLUSHTX);

    /* Send the phy length byte first */
    rfcore_write_byte(hdr_size + len + CC2538_AUTOCRC_LEN);
    rfcore_write_fifo(&hdr, hdr_size);
    rfcore_write_fifo(buf, len);
    rfcore_tx_frame_hook(buf, len);

