RIOT-OS/RIOT/cpu/cc2538/radio/cc2538-rf.c
    /* TODO: Wait for ACK if wants_ack? */

    return RADIO_TX_OK;
}

static uint_fast8_t txon_instr = ISTXON;

radio_tx_status_t cc2538_transmit_tx_buf(void)
{
    bool was_off = false;

    if (!cc2538_is_on()) {
        was_off = true;
        cc2538_on();
        RFCORE_WAIT_UNTIL(RFCORE->XREG_FSMSTAT0bits.FSM_FFCTRL_STATE > FSM_STATE_RX_CALIBRATION);
    }

    if (!cc2538_channel_clear()) {
        return RADIO_TX_COLLISION;
    }

    if (RFCORE->XREG_FSMSTAT1bits.SFD) {
        return RADIO_TX_COLLISION;
    }

    /* Start the transmission */
    rfcore_strobe(txon_instr);

    if (was_off) {
        /* Wait for transmission to start */
        RFCORE_WAIT_UNTIL(RFCORE->XREG_FSMSTAT1bits.TX_ACTIVE);

        cc2538_off();
    }

    return RADIO_TX_OK;
}

radio_tx_status_t cc2538_send(ieee802154_packet_kind_t kind,
                              ieee802154_node_addr_t dest,
                              bool use_long_addr,
                              bool wants_ack,
                              void *buf,
                              unsigned int len)
{
    radio_tx_status_t result;

    result = cc2538_load_tx_buf(kind, dest, use_long_addr, wants_ack, buf, len);

    if (result != RADIO_TX_OK) {
        return result;
    }

    result = cc2538_transmit_tx_buf();
    return result;
}

int16_t cc2538_send_lowlevel(const void *buf, int len)
{
    unsigned int packet_len;

    packet_len = len + CC2538_FCS_LEN;

    if (len <= 0) {
        return RADIO_TX_INVALID_PARAM;
    }

    if (packet_len > CC2538_RF_MAX_PACKET_LEN) {
        return RADIO_TX_PACKET_TOO_LONG;
    }

    if (RFCORE->XREG_FSMSTAT1bits.TX_ACTIVE) {
        return RADIO_TX_MEDIUM_BUSY;
    }

    RFCORE_ASSERT(cc2538_is_on());

    rfcore_strobe(ISFLUSHTX);

    /* Send the phy length byte first */
    rfcore_write_byte(packet_len);
    rfcore_write_fifo(buf, len);
    rfcore_tx_frame_hook(buf, len);

    return cc2538_transmit_tx_buf();
}

int16_t cc2538_send_ieee802154_packet(ieee802154_packet_t *packet)
{
    uint8_t header[IEEE_802154_MAX_HDR_LEN];
    uint_fast8_t header_size, total_size;

    /* Generate the 802.15.4 header: */
    header_size = ieee802154_frame_init(&packet->frame, header);

    /* The damage is already done if this fails: */
    RFCORE_ASSERT(header_size < IEEE_802154_MAX_HDR_LEN);

    total_size = header_size + packet->frame.payload_len;
    if (CC2538_PACKET_LENGTH_SIZE + total_size > CC2538_RF_FIFO_SIZE) {
        return RADIO_TX_PACKET_TOO_LONG;
    }

    if (RFCORE->XREG_FSMSTAT1bits.TX_ACTIVE) {
        return RADIO_TX_MEDIUM_BUSY;
    }

    RFCORE_ASSERT(cc2538_is_on());

    rfcore_strobe(ISFLUSHTX);

    /* Send the phy length byte first */
    rfcore_write_byte(total_size + CC2538_FCS_LEN);
    rfcore_write_fifo(header, header_size);
    rfcore_write_fifo(packet->frame.payload, packet->frame.payload_len);

    return cc2538_transmit_tx_buf();
}

void cc2538_set_recv_callback(receive_802154_packet_callback_t recv_cb)
{
    recv_func = recv_cb;
}

#if ENABLE_DEBUG
static void printf_hex(const void *buf, size_t len)
{
    size_t n;

    if (len <= 0) {
        return;
    }

    printf("%02x", ((const uint8_t *)buf)[0]);

    for (n = 1; n < len; n++) {
        printf(":%02x", ((const uint8_t *)buf)[n]);
    }
}
#endif

void rfcore_rx_frame_hook(const void *buf, uint_fast8_t len, const cc2538_fcs_t *fcs)
{
#if ENABLE_DEBUG
    DEBUG_PRINT("%s(): Received ", __FUNCTION__);
    printf_hex(buf, len);
    DEBUG_PRINT(", RSSI=%d, CRC=%u, LQI=%u\n", fcs->rssi - CC2538_RSSI_OFFSET, fcs->crc, fcs->lqi);
#endif /* ENABLE_DEBUG */
}

void rfcore_tx_frame_hook(const void *buf, uint_fast8_t len)
{
#if ENABLE_DEBUG
    DEBUG_PRINT("%s(): Sending ", __FUNCTION__);
    printf_hex(buf, len);
    DEBUG_PRINT("\n");
#endif /* ENABLE_DEBUG */
}

/* CC2538 low-level radio driver definition */
const ieee802154_radio_driver_t cc2538_radio_driver = {
    .init                 = cc2538_initialize,
    .on                   = cc2538_on,
    .off                  = cc2538_off,
    .is_on                = cc2538_is_on,
    .load_tx              = cc2538_load_tx_buf,
    .transmit             = cc2538_transmit_tx_buf,
    .send                 = cc2538_send,
    .set_receive_callback = cc2538_set_recv_callback,
    .switch_to_rx         = cc2538_switch_to_rx,
    .set_channel          = cc2538_set_channel,
    .get_channel          = cc2538_get_channel,
    .set_address          = cc2538_set_address,
    .get_address          = cc2538_get_address,
    .set_long_address     = cc2538_set_address_long,
    .get_long_address     = cc2538_get_address_long,
    .set_pan_id           = cc2538_set_pan,
    .get_pan_id           = cc2538_get_pan,
    .set_tx_power         = cc2538_set_tx_power,
    .get_tx_power         = cc2538_get_tx_power,
    .channel_is_clear     = cc2538_channel_clear,
    .set_promiscuous_mode = cc2538_set_monitor,
    .in_promiscuous_mode  = cc2538_get_monitor,
};
